; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v7 ?v8)
             (pred_9 ?v3 ?v13)
             (pred_10 ?v7 ?v13)
             (pred_2 ?v10 ?v7 )
	     (pred_5 ?v7)
             (pred_6 ?v6)
             (pred_3 ?v3)
             (pred_7 ?v13)
             (pred_12 ?v7)
             (pred_1 ?v3)
             (pred_4 ?v7)
             (pred_11 ))



(:action op_5
:parameters (?v1 ?v4 ?v5 ?v2)
:precondition (and (pred_6 ?v1) (pred_6 ?v4) (pred_3 ?v5) (pred_7 ?v2)
          (pred_8 ?v1 ?v4) (pred_9 ?v5 ?v2)
                   (pred_10 ?v4 ?v2) (pred_5 ?v1) 
                   (pred_12 ?v4) (pred_1 ?v5))
:effect (and  (pred_4 ?v4) (not (pred_12 ?v4))))


(:action op_1
:parameters (?v1 ?v9)
:precondition (and (pred_6 ?v1) (pred_6 ?v9)
               (pred_5 ?v1) (pred_8 ?v1 ?v9) (pred_4 ?v9))
:effect (and (pred_5 ?v9) (not (pred_5 ?v1))))

(:action op_2
:parameters (?v1 ?v5)
:precondition (and (pred_6 ?v1) (pred_3 ?v5) 
                  (pred_5 ?v1) (pred_2 ?v5 ?v1) (pred_11 ))
:effect (and (pred_1 ?v5)
   (not (pred_2 ?v5 ?v1)) (not (pred_11 ))))


(:action op_3
:parameters (?v1 ?v12 ?v11)
:precondition (and (pred_6 ?v1) (pred_3 ?v12) (pred_3 ?v11)
                  (pred_5 ?v1) (pred_1 ?v11) (pred_2 ?v12 ?v1))
:effect (and (pred_1 ?v12) (pred_2 ?v11 ?v1)
        (not (pred_1 ?v11)) (not (pred_2 ?v12 ?v1))))

(:action op_4
:parameters (?v1 ?v5)
:precondition (and (pred_6 ?v1) (pred_3 ?v5) 
                  (pred_5 ?v1) (pred_1 ?v5))
:effect (and (pred_11 ) (pred_2 ?v5 ?v1) (not (pred_1 ?v5)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_13 obj_31 obj_11 obj_08 obj_19 obj_03 obj_04 obj_22 obj_05 obj_10 obj_30 obj_21 obj_06 obj_27 obj_16 obj_09 obj_20 obj_15 obj_02 obj_28 obj_01 obj_23 obj_24 obj_29 obj_18
    obj_07 obj_14 obj_25
    obj_17 obj_12 obj_26
    )

    (:init
       (pred_11)

       (pred_6 obj_13)
       (pred_6 obj_31)
       (pred_6 obj_11)
       (pred_6 obj_08)
       (pred_6 obj_19)
       (pred_6 obj_03)
       (pred_6 obj_04)
       (pred_6 obj_22)
       (pred_6 obj_05)
       (pred_6 obj_10)
       (pred_6 obj_30)
       (pred_6 obj_21)
       (pred_6 obj_06)
       (pred_6 obj_27)
       (pred_6 obj_16)
       (pred_6 obj_09)
       (pred_6 obj_20)
       (pred_6 obj_15)
       (pred_6 obj_02)
       (pred_6 obj_28)
       (pred_6 obj_01)
       (pred_6 obj_23)
       (pred_6 obj_24)
       (pred_6 obj_29)
       (pred_6 obj_18)
       (pred_7 obj_07)
       (pred_7 obj_14)
       (pred_7 obj_25)
       (pred_3 obj_17)
       (pred_3 obj_12)
       (pred_3 obj_26)

       (pred_8 obj_13 obj_03)
       (pred_8 obj_13 obj_31)
       (pred_8 obj_31 obj_04)
       (pred_8 obj_31 obj_11)
       (pred_8 obj_31 obj_13)
       (pred_8 obj_11 obj_22)
       (pred_8 obj_11 obj_08)
       (pred_8 obj_11 obj_31)
       (pred_8 obj_08 obj_05)
       (pred_8 obj_08 obj_19)
       (pred_8 obj_08 obj_11)
       (pred_8 obj_19 obj_10)
       (pred_8 obj_19 obj_08)
       (pred_8 obj_03 obj_30)
       (pred_8 obj_03 obj_04)
       (pred_8 obj_03 obj_13)
       (pred_8 obj_04 obj_21)
       (pred_8 obj_04 obj_22)
       (pred_8 obj_04 obj_31)
       (pred_8 obj_04 obj_03)
       (pred_8 obj_22 obj_06)
       (pred_8 obj_22 obj_05)
       (pred_8 obj_22 obj_11)
       (pred_8 obj_22 obj_04)
       (pred_8 obj_05 obj_27)
       (pred_8 obj_05 obj_10)
       (pred_8 obj_05 obj_08)
       (pred_8 obj_05 obj_22)
       (pred_8 obj_10 obj_16)
       (pred_8 obj_10 obj_19)
       (pred_8 obj_10 obj_05)
       (pred_8 obj_30 obj_09)
       (pred_8 obj_30 obj_21)
       (pred_8 obj_30 obj_03)
       (pred_8 obj_21 obj_20)
       (pred_8 obj_21 obj_06)
       (pred_8 obj_21 obj_04)
       (pred_8 obj_21 obj_30)
       (pred_8 obj_06 obj_15)
       (pred_8 obj_06 obj_27)
       (pred_8 obj_06 obj_22)
       (pred_8 obj_06 obj_21)
       (pred_8 obj_27 obj_02)
       (pred_8 obj_27 obj_16)
       (pred_8 obj_27 obj_05)
       (pred_8 obj_27 obj_06)
       (pred_8 obj_16 obj_28)
       (pred_8 obj_16 obj_10)
       (pred_8 obj_16 obj_27)
       (pred_8 obj_09 obj_01)
       (pred_8 obj_09 obj_20)
       (pred_8 obj_09 obj_30)
       (pred_8 obj_20 obj_23)
       (pred_8 obj_20 obj_15)
       (pred_8 obj_20 obj_21)
       (pred_8 obj_20 obj_09)
       (pred_8 obj_15 obj_24)
       (pred_8 obj_15 obj_02)
       (pred_8 obj_15 obj_06)
       (pred_8 obj_15 obj_20)
       (pred_8 obj_02 obj_29)
       (pred_8 obj_02 obj_28)
       (pred_8 obj_02 obj_27)
       (pred_8 obj_02 obj_15)
       (pred_8 obj_28 obj_18)
       (pred_8 obj_28 obj_16)
       (pred_8 obj_28 obj_02)
       (pred_8 obj_01 obj_23)
       (pred_8 obj_01 obj_09)
       (pred_8 obj_23 obj_24)
       (pred_8 obj_23 obj_20)
       (pred_8 obj_23 obj_01)
       (pred_8 obj_24 obj_29)
       (pred_8 obj_24 obj_15)
       (pred_8 obj_24 obj_23)
       (pred_8 obj_29 obj_18)
       (pred_8 obj_29 obj_02)
       (pred_8 obj_29 obj_24)
       (pred_8 obj_18 obj_28)
       (pred_8 obj_18 obj_29)
       (pred_12 obj_08)
       (pred_12 obj_04)
       (pred_12 obj_13)
       (pred_10  obj_08 obj_07)
       (pred_10  obj_04 obj_14)
       (pred_10  obj_13 obj_25)
       (pred_4 obj_31)
       (pred_4 obj_11)
       (pred_4 obj_19)
       (pred_4 obj_03)
       (pred_4 obj_22)
       (pred_4 obj_05)
       (pred_4 obj_10)
       (pred_4 obj_30)
       (pred_4 obj_21)
       (pred_4 obj_06)
       (pred_4 obj_27)
       (pred_4 obj_16)
       (pred_4 obj_09)
       (pred_4 obj_20)
       (pred_4 obj_15)
       (pred_4 obj_02)
       (pred_4 obj_28)
       (pred_4 obj_01)
       (pred_4 obj_23)
       (pred_4 obj_24)
       (pred_4 obj_29)
       (pred_4 obj_18)

       (pred_9  obj_17 obj_07)
       (pred_9  obj_12 obj_14)
       (pred_9  obj_26 obj_25)
       (pred_2 obj_17 obj_03)
       (pred_2 obj_12 obj_09)
       (pred_2 obj_26 obj_08)
       (pred_5 obj_11)
    )

    (:goal (and
       (pred_2 obj_17 obj_02)
       (pred_2 obj_12 obj_30)
    ))
(:constraints
  (always (not (pred_5 obj_06)))
)
)

; plan
1. (op_1 obj_11 obj_22)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_22)
   goals met: 0 of 2
2. (op_1 obj_22 obj_05)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_05)
   goals met: 0 of 2
3. (op_1 obj_05 obj_27)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_27)
   goals met: 0 of 2
4. (op_1 obj_27 obj_02)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_02)
   goals met: 0 of 2
5. (op_1 obj_02 obj_15)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_15)
   goals met: 0 of 2
6. (op_1 obj_15 obj_20)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_20)
   goals met: 0 of 2
7. (op_1 obj_20 obj_09)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_09)
   goals met: 0 of 2
8. (op_2 obj_09 obj_12)
   deleted: (pred_2 obj_12 obj_09) (pred_11)
   added: (pred_1 obj_12)
   goals met: 0 of 2
9. (op_1 obj_09 obj_30)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_30)
   goals met: 0 of 2
10. (op_4 obj_30 obj_12)
   deleted: (pred_1 obj_12)
   added: (pred_11) (pred_2 obj_12 obj_30)
   goals met: 1 of 2
11. (op_1 obj_30 obj_03)
   deleted: (pred_5 obj_30)
   added: (pred_5 obj_03)
   goals met: 1 of 2
12. (op_2 obj_03 obj_17)
   deleted: (pred_2 obj_17 obj_03) (pred_11)
   added: (pred_1 obj_17)
   goals met: 1 of 2
13. (op_1 obj_03 obj_30)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_30)
   goals met: 1 of 2
14. (op_1 obj_30 obj_21)
   deleted: (pred_5 obj_30)
   added: (pred_5 obj_21)
   goals met: 1 of 2
15. (op_1 obj_21 obj_20)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_20)
   goals met: 1 of 2
16. (op_1 obj_20 obj_15)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_15)
   goals met: 1 of 2
17. (op_1 obj_15 obj_02)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_02)
   goals met: 1 of 2
18. (op_4 obj_02 obj_17)
   deleted: (pred_1 obj_17)
   added: (pred_11) (pred_2 obj_17 obj_02)
   goals met: 2 of 2
